tutorials/multiform/specCellFoam/packingCellLayers/system/domainsize
scalegrid 1.736466;
x1 0.000000;
y1 0.000000;
z1 0.000000;
xin 0.500000;
yin 0.010000;
zin 0.000000;
x2 1.000000;
y2 1.000000;
z2 1.000000;
xgrid 120;
ygrid 120;
zgrid 120;
snap true;
#inputMode merge