tutorials/multiform/specCellFoam/packingCellLayers/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name   right;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.4999 -0.5 0) (0.50001 1 1); // Edit box bounds as required
        }
    }

    {
        name    bottom;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.5 -0.50001 0) (0.5 -0.49999 1); // Edit box bounds as required
        }
    }

    {
        name    left;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.500001 -0.5 0) (-0.499999 1 1); // Edit box bounds as required
        }
    }

    {
        name    top;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.5 0.4999 0) (0.51 0.51 1); // Edit box bounds as required
        }
    }
);

// ************************************************************************* //
